app/Http/Controllers/CategoriesController.php

select exists(select * from `seopages` where `slug` = 'https://dveri-city.kz/catalog/aksessuary') as `exists`
---
    public function catalogAccessories()
    {
        $catSlug = 'aksessuary';
        $category = Category::with('products')->with('parent')->where('slug', $catSlug)->first();
        $seo_page = Seopage::where('slug', \Request::url());
        if ($seo_page->exists()) {

select exists(select * from `seopages` where `slug` = 'https://dveri-city.kz/catalog/mezhkomnatnye-dveri') as `exists`
---
    public function index($catSlug)
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('app.fallback_locale');
        $category = Category::with(['products','translations'])->with('parent')->where('slug', $catSlug)->first();
        $seo_page = Seopage::where('slug', \Request::url());
        if ($seo_page->exists()) {