app/Http/Controllers/PageController.php

select exists(select * from `seopages` where `slug` = 'https://dveri-city.kz/page/contacts') as `exists`
---
    public function getPage($slug)
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('app.fallback_locale');
        $page = Page::whereSlug($slug)->first();
        $seo_page = Seopage::where('slug', \Request::url());
        if ($seo_page->exists()) {