app/Providers/AppServiceProvider.php

    public function boot()
    {
        Schema::defaultStringLength(191);

        view()->composer(['*'], function ($view)
        {
            $seo_page = Seopage::where('slug',\Request::url())->cacheFor(2592000)->cacheTags(['seo_page','seo','seopage']);
            if ($seo_page->exists()){
---
select exists(select * from `seopages` where `slug` = 'https://dveri-city.kz/catalog/mezhkomnatnye-dveri') as `exists`